###############################################################################

# LAPPLY ----------------------------------------------------------------------

variable <- NULL      # dále vytvořím agregované kategorie
variable <- unlist(
  pblapply(
    1:dim(df2)[1],
    function(i){
      switch(df2$NAB_VIRA[i],
             "bez náboženské víry" = "Bez víry",
             "Ateismus" = "Bez víry",
             "věřící1" = "Věřící",
             "věřící2" = "Věřící",
             "nezjištěno" = "nezjištěno")
    }
  )
)

# -----------------------------------------------------------------------------

###############################################################################

# FOR -------------------------------------------------------------------------

variable <- for (i in 1: 1:dim(df2)[1]){
  switch(df2$NAB_VIRA[i],
         "bez náboženské víry" = "Bez víry",
         "Ateismus" = "Bez víry",
         "věřící1" = "Věřící",
         "věřící2" = "Věřící",
         "nezjištěno" = "nezjištěno")
}

# -----------------------------------------------------------------------------

###############################################################################
